resources/closeSession.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <WOKMWSAuthentcate:closeSession
                xmlns:WOKMWSAuthentcate="http://auth.cxf.wokmws.thomsonreuters.com"/>
    </soap:Body>
</soap:Envelope>