wos/auth.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:ns="http://auth.cxf.wokmws.thomsonreuters.com" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soapenv:Header/>
	<soapenv:Body>
		<ns:authenticate/>
	</soapenv:Body>
</soapenv:Envelope>